# SegmentLengthRounding Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarRoundingManager..::..SegmentLengthRounding Property
RebarRoundingManager Class See Also
---
The rounding for shared parameters used by rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double SegmentLengthRounding { get; set; }
```

Visual Basic
---
```text
Public Property SegmentLengthRounding As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SegmentLengthRounding {
	double get ();
	void set (double value);
}
```

# Remarks
IsActiveOnElement property has to be true. SegmentLengthRounding is meaningless if IsActiveOnElement is false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for value is not a number |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The rounding value is not a positive value. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: IsActiveOnElement property is false. |

# See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace